{
  "publications": [
    {
      "title": "Dog Breeding",
      "body": "Welcoming a dog into your home is a big responsibility because you must provide the animal with a happy and fulfilled life. Many, if not all, people have preferences for specific breeds that they find to be more friendly, cute, etc. As a result, most people will end up buying a dog from a breeder or pet store rather than adopting from a shelter. While you may be able to select your favorite breed, there are significant consequences behind your actions. Certain breeders, as well as most puppy mills that supply pet shops, treat their dogs with little to no care. Thus, purchasing from these institutions is synonymous with supporting an industry that provides insufficient care for its animals. <br> Animal rights organizations (e.g. Humane Society of the United States) encourage adoption from a shelter or rescue center. However, if you choose to buy from a private breeder, you must ensure that the dog is well-raised from a responsible breeder. A responsible breeder must be transparent about the environment that they raise the dogs. Rather than raising dogs in crowded cages, it is important that they are trained in a clean, spacious, and well-maintained area. <br> An irresponsible breeder, also called a backyard breeder, would attempt to save cash by neglecting veterinary care. They would breed the dogs freely, without prior testing for hereditary diseases such as heart conditions, hip defects, or other genetic abnormalities. This can result in health issues in both the parents and the puppies, which may be hard to detect at first glance. Oftentimes, what happens is that someone will ignorantly purchase a dog only for the symptoms to show up years later, when they’ve formed an unbreakable bond with the dog. In addition to neglecting veterinary care, lack of social bonds can be detrimental. For the first few months after birth, a puppy needs a lot of socialization with their mother and siblings. Being separated from their family at an early age or not receiving enough socialization can hinder emotional growth. This may lead to emotional instability problems, such as extreme shyness, endless aggression, and/or anxiety. <br> Puppy mills are dog breeding centers for the commercial pet market. These mills sell puppies through ads or by supplying them to a pet store. The living conditions of puppies at these puppy mills are extremely poor and unsatisfactory. <br> Within these puppy mills, dogs are confined in kennels for their entire lifespan and bred in unnatural ways. Worst of all, dogs are forced into tiny cages and sleep in their own feces and urine. They receive minimal protection from the weather and little to no exercise. If any animals were to fall sick, they often do not receive veterinary care, and once they become elderly or are unable to continue breeding, puppy mill owners will abandon or euthanize them. <br> In addition, the state of the puppy mills reflects how puppies are born. Newborn puppies are taken away from their mothers far too early and often suffer from health problems. Dogs raised and born in puppy mills are also more likely to have behavioral issues as they grow older."
    },
    {
      
    }
  ]
}    